CSI API ETABS v1
cPropRebar.GetRebarProps Method
 Retrieves dimension data for a rebar property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarProps(
	string Name,
	ref double Area,
	ref double Diameter
)
Function GetRebarProps (
	Name As String,
	ByRef Area As Double,
	ByRef Diameter As Double
) As Integer
Dim instance As cPropRebar
Dim Name As String
Dim Area As Double
Dim Diameter As Double
Dim returnValue As Integer
returnValue = instance.GetRebarProps(Name,
	Area, Diameter)
int GetRebarProps(
	String^ Name,
	double% Area,
	double% Diameter
)
abstract GetRebarProps :
        Name : string *
        Area : float byref *
        Diameter : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing rebar property
Area
Type: System.Double
Diameter
Type: System.Double
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero
Remarks
See Also
Reference
cPropRebar Interface
ETABSv1 Namespace